In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [53]:
df = pd.read_csv(r'women_clothing_ecommerce_sales.csv')

# transforming the column "order_date" to only date format since we are not going to analyse hourly trends
df['order_date'] = pd.to_datetime(df['order_date']).dt.date
# groupby to sum the days are repeated
df = df.groupby(by=['order_date', 'sku', 'color']).agg('quantity':'sum', )

df = df.set_index('order_date')

In [3]:
df.shape

(527, 8)

In [54]:
df.head()

,order_id,order_date,sku,color,size,unit_price,quantity,revenue
0,1,2022-06-01,708,Dark Blue,2XL,298,1,298
1,1,2022-06-01,89,Dark Blue,2XL,258,1,258
2,2,2022-06-10,bobo,Cream,One Size,228,1,228
3,3,2022-06-10,799,Dark Blue,XL,264,1,264
4,4,2022-06-11,799,Dark Blue,M,264,1,264

# Exploratory Data Analysis

In [9]:
df.describe()
# usually customer dont purchase more than one item per visit

         order_id  unit_price    quantity     revenue
count  527.000000  527.000000  527.000000  527.000000
mean   115.313093  274.973435    1.011385  278.024668
std     73.106716   34.517412    0.106193   44.741095
min      1.000000  191.000000    1.000000  191.000000
25%     54.000000  266.000000    1.000000  266.000000
50%    110.000000  278.000000    1.000000  278.000000
75%    166.000000  288.000000    1.000000  288.000000
max    273.000000  899.000000    2.000000  899.000000

In [11]:
df.info()
# only size column has missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 527 entries, 0 to 526
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    527 non-null    int64
 1   order_date  527 non-null    object
 2   sku         527 non-null    object
 3   color       527 non-null    object
 4   size        490 non-null    object
 5   unit_price  527 non-null    int64
 6   quantity    527 non-null    int64
 7   revenue     527 non-null    int64
dtypes: int64(4), object(4)
memory usage: 33.1+ KB

In [30]:
df['sku'].value_counts()
# the product that have the most quantity of sales is the "799" with more than 50% of the whole sales
# there is a non numeric value named "bobo" that should be modified to numeric

799      283
708       99
bobo      16
239       16
77        16
9699      16
89        13
3799       9
79         9
1719       8
218        7
3081       5
61399      4
2499       4
339        4
127        3
897        3
8499       3
229        2
1499       2
539        2
628        1
29         1
439        1
Name: sku, dtype: int64

In [50]:
df['size'].value_counts()
# XL is the size with most of the sales

XL          164
M            92
L            91
One Size     45
2XL          43
3XL          40
4XL           9
One SIze      5
S             1
Name: size, dtype: int64

In [51]:
df.head()

            order_id   sku      color      size  unit_price  quantity  revenue
order_date
2022-06-01         1   708  Dark Blue       2XL         298         1      298
2022-06-01         1    89  Dark Blue       2XL         258         1      258
2022-06-10         2  bobo      Cream  One Size         228         1      228
2022-06-10         3   799  Dark Blue        XL         264         1      264
2022-06-11         4   799  Dark Blue         M         264         1      264